---
kind: other
id: Methods.T:Autodesk.Revit.DB.EdgeEndPoint
source: html/ffcfc784-2bad-b79e-5a2e-1396da311c12.htm
---
# EdgeEndPoint Methods

Determines whether this EdgeEndPoint is equal to another.